In [2]:
import pandas as pd
import matplotlib.pyplot as splt 
%matplotlib inline

In [3]:
df = pd.read_csv('status.csv')

In [4]:
df

    age  status
0    18     0.0
1    21     1.0
2    23     0.0
3    24     1.0
4    25     1.0
5    22     1.0
6    17     0.0
7    15     1.0
8    19     1.0
9    20     0.0
10   26     NaN
11   17     1.0
12   28     0.0
13   29     1.0
14   30     0.0
15   24     1.0
16   20     0.0
17   50     1.0
18   33     0.0

In [5]:
df.shape

(19, 2)

In [6]:
df.isnull().sum()

age       0
status    1
dtype: int64

In [7]:
handle =df['status'].median()

In [8]:
handle

1.0

In [9]:
df.status = df.status.fillna(handle)

In [10]:
df

    age  status
0    18     0.0
1    21     1.0
2    23     0.0
3    24     1.0
4    25     1.0
5    22     1.0
6    17     0.0
7    15     1.0
8    19     1.0
9    20     0.0
10   26     1.0
11   17     1.0
12   28     0.0
13   29     1.0
14   30     0.0
15   24     1.0
16   20     0.0
17   50     1.0
18   33     0.0

In [11]:
df['status'].value_counts()

1.0    11
0.0     8
Name: status, dtype: int64

In [12]:
x = df[['status']]

In [13]:
x

    status
0      0.0
1      1.0
2      0.0
3      1.0
4      1.0
5      1.0
6      0.0
7      1.0
8      1.0
9      0.0
10     1.0
11     1.0
12     0.0
13     1.0
14     0.0
15     1.0
16     0.0
17     1.0
18     0.0

In [14]:
y=df[['age']]

In [15]:
y

    age
0    18
1    21
2    23
3    24
4    25
5    22
6    17
7    15
8    19
9    20
10   26
11   17
12   28
13   29
14   30
15   24
16   20
17   50
18   33

In [16]:
from sklearn.model_selection import train_test_split

In [21]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=.30,random_state=1)

In [24]:
xtest

    status
3      1.0
15     1.0
6      0.0
10     1.0
2      0.0
14     0.0

In [25]:
ytest

    age
3    24
15   24
6    17
10   26
2    23
14   30

In [26]:
from sklearn.linear_model import LogisticRegression

In [27]:
model =  LogisticRegression()

In [28]:
model.fit(xtrain,ytrain)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression()

In [31]:
model.predict(xtest)

array([20, 20, 20, 20, 20, 20], dtype=int64)

In [32]:
model.score(xtest,ytest)

0.0

In [33]:
model.predict_proba(xtest)

array([[0.08770355, 0.08770355, 0.06391806, 0.08770355, 0.10661745,
        0.08770355, 0.08770355, 0.08770355, 0.06391806, 0.08770355,
        0.06391806, 0.08770355],
       [0.08770355, 0.08770355, 0.06391806, 0.08770355, 0.10661745,
        0.08770355, 0.08770355, 0.08770355, 0.06391806, 0.08770355,
        0.06391806, 0.08770355],
       [0.05967365, 0.05967365, 0.09773308, 0.05967365, 0.22941158,
        0.05967365, 0.05967365, 0.05967365, 0.09773308, 0.05967365,
        0.09773308, 0.05967365],
       [0.08770355, 0.08770355, 0.06391806, 0.08770355, 0.10661745,
        0.08770355, 0.08770355, 0.08770355, 0.06391806, 0.08770355,
        0.06391806, 0.08770355],
       [0.05967365, 0.05967365, 0.09773308, 0.05967365, 0.22941158,
        0.05967365, 0.05967365, 0.05967365, 0.09773308, 0.05967365,
        0.09773308, 0.05967365],
       [0.05967365, 0.05967365, 0.09773308, 0.05967365, 0.22941158,
        0.05967365, 0.05967365, 0.05967365, 0.09773308, 0.05967365,
        0.09773308, 0.05967365]])